# -*- coding: cp1251 -*-
import math

name = input("Введите название планеты: ")
if name == "Земля" or name == "земля":
    m = 5.976 * 10**24
    r = 6371000
elif name == "Венера" or name == "венера":
    m = 4.8866 * 10**24
    r = 6051800
elif name == "Кербин" or name == "кербин":
    m = 5.2915 * 10**22
    r = 600000
elif name == "Ева" or name == "ева" or name == "Ив" or name == "ив":
    m = 1.2244 * 10**23
    r = 700000
else:
    print("Эта планета не соответствует миссии")
    exit
h = int(input("Введите высоту над поверхностью планеты, м: "))
v = math.sqrt( (6.6743015 * 10**(-11) * m) / (r + h) )
print("Первая космическая скорость равна    ", v, "м/с")
